Revit 2027 API
FamilyParameter.IsReporting Property
Indicates if the parameter is a reporting parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsReporting { get; }
Public ReadOnly Property IsReporting As Boolean
	Get
public:
property bool IsReporting {
	bool get ();
}
member IsReporting : bool with get
Property Value
Boolean
Remarks
If true, the parameter is a reporting parameter associated to a dimension value, and cannot be modified. If false, the parameter is a driving parameter and if associated to a dimension, can modify the dimension it labels.
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace